''' Модуль для расчета результатов пробы Руфье.

Сумма измерений пульса в трех попытках (до нагрузки, сразу после и после короткого отдыха)
в идеале должна быть не более 200 ударов в минуту. 
Мы предлагаем детям измерять свой пульс на протяжении 15 секунд, 
и приводим результат к ударам в минуту умножением на 4:
    S = 4 * (P1 + P2 + P3)
Чем дальше этот результат от идеальных 200 ударов, тем хуже.
Традиционно таблицы даются для величины, делённой на 10. 

Индекс Руфье   
    IR = (S - 200) / 10
оценивается по таблице в соответствии с возрастом:
        7-8             9-10                11-12               13-14               15+ (только для подростков!)
отл.     < 6.5           < 5                 < 3.5               < 2                 < 0.5  
хор.    >= 6.5 и < 12   >= 5 и < 10.5       >= 3.5 и < 9        >= 2 и < 7.5        >= 0.5 и < 6
удовл.  >= 12 и < 17    >= 10.5 и < 15.5    >= 9 и < 14         >= 7.5 и < 12.5     >= 6 и < 11
слабый  >= 17 и < 21    >= 15.5 и < 19.5    >= 14 и < 18        >= 12.5 и < 16.5    >= 11 и < 15
неуд.   >= 21           >= 19.5             >= 18               >= 16.5             >= 15

для всех возрастов результат "неуд" отстоит от "слабого" на 4, 
тот от "удовлетворительного" на 5, а "хороший" от "уд" - на 5.5

поэтому напишем функцию ruffier_result(r_index, level), которая будет получать
рассчитанный индекс Руфье и уровень "неуд" для возраста тестируемого, и отдавать результат

'''
# здесь задаются строки, с помощью которых изложен результат:
txt_index = "Ваш индекс Руфье: "
txt_workheart = "Работоспособность сердца: "
txt_nodata = '''нет данных для такого возраста'''
txt_res = [] 
txt_res.append('''низкая. Срочно обратитесь к врачу!''')
txt_res.append('''удовлетворительная. Обратитесь к врачу!''')
txt_res.append('''средняя. Возможно, стоит дополнительно обследоваться у врача.''')
txt_res.append('''выше среднего''')
txt_res.append('''высокая''')

def ruffier_index(P1, P2, P3):
    index = (4*(P1+P2+P3)-200)/10
    return index

def neud_level(age):
    norm_age = (min(15, age)-7)//2
    level = 21 - norm_age*1.5
    return level
    
def ruffier_result(index, level):
    if index >= level:
        return 0
    level -= 4
    if index >= level:
        return 1
    level -= 5
    if index >= level:
        return 2
    level -= 5.5
    if index >= level:
        return 3
    return 4

def test(P1, P2, P3, age):
    if age < 7:
        return (txt_index + "0", txt_nodata) # тайна сия не для теста сего
    else:
        final_text = txt_index + str(ruffier_index(P1, P2, P3)) + '\n' + txt_workheart + txt_res[ruffier_result(ruffier_index(P1, P2, P3), neud_level(age))]
        return final_text
